rails_backend/app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."email" = ? LIMIT ?  [["email", "admin@example.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:email])